IoT-EBOT/IoT-Home-Sistem-with-STM32-and-Raspberry/Controlador Maestro/Microcontrolador Maestro/Maestro Tranceptor Conectado a Raspberry.cpp
//CODIGO MAESTRO-TRANSCEPTOR RASPBERRY PI Y PERISFERICOS
//DANIEL FELIPE GOMEZ BERNAL
//CRISTIAN DAVID COBOS SARTA      

/*
 DISPOSITIVO | FRECUENCIA DE TRABAJO | DIRECCION |  USO |
-------------|-----------------------|-----------|------|
RASPBERRY    |        2400           | 0x000002  |  YA  |
DISPENSADOR  |        2420           | 0x00000A  |  YA  |
TOMA CORR    |        2440           | 0x00000B  |  YA  |
DIMMER       |        2460           | 0x00000C  |  YA  |
CAMARA-PUERTA|        2480           | 0x00000D  |  YA  |
*/   

//------------------------------------------------------------------------ LIBRERIAS ---------------------------------------------------------------

#include "mbed.h"
#include "nRF24L01P.h"

//------------------------------------------------------------------------ DEFINICIONES ---------------------------------------------------------------

#define MI_FREQ 2400
#define POT  0
#define VELO 250
#define DIR_MAESTRO 0x000002   //DIRECCION DE RECEPCION DEL MAESTRO

#define RF_DISPENSADOR 2420
#define DIR_DISPENSADOR 0x00000A      //DIRECCION DE RECEPCION EXCLAVO 1

#define RF_TOMA 2440
#define DIR_TOMA 0x00000B      //DIRECCION DE RECEPCION EXCLAVO 2

#define RF_DIMMER 2460
#define DIR_DIMMER 0x00000C

#define RF_PUERTA 2480
#define DIR_PUERTA 0x00000D

#define TAM_DIRECCIONES 3
#define TAM_TX 4

#define RETARDO 2000

//------------------------------------------------------------------------ CREACION DE OBJETOS ---------------------------------------------------------------

nRF24L01P RADIO(PB_5, PB_4, PB_3, PA_15, PA_12);    // MOSI, MISO, SCK, CSN, CE, IRQ
Serial RASPBERRY(PA_9,PA_10);  //TX,RX
Serial PC(PA_2,PA_3);  //TX,RX
DigitalOut ON(PC_13);
Timeout ESPERAR_T_CAMARA;
//------------------------------------------------------------------------ DEFINICION DE FUNCIONES ---------------------------------------------------------------

void CONF_INIC (int FRECUENCIA, int POTENCIA, int VELOCIDAD, unsigned long long DIRECCION, int ANCHO, int TUBERIA);
void ESTADO_I (void);
void PREPARAR (int ANCHO, unsigned long long DIRECCION, int TAM_DIR, int RF);
void RECIBIR (void);
void ENVIAR_CICLO (void);
void LEER_RASPBERRY (void);
void ENVIAR_ALERTAS (void);
void HABILITAR_RECP_CAMARA (void);

//------------------------------------------------------------------------ VARIABLES GLOBALES ---------------------------------------------------------------

char DATA_TX [TAM_TX];
char RX_DATA [TAM_TX];

char OPCION = 0;

char FG_DIMMER = 0;
char DATA_CICLO [TAM_TX];
char FG_INTERRUPTOR_ON = 0;
char FG_INTERRUPTOR_OFF = 0;

char INTE_OFF [TAM_TX] = {'L','G','O','F'};
char CONF_CIC [TAM_TX] = {'C','U','R','R'};
char FOOD_ON [TAM_TX] = {'F','D','O','N'};
char WATE_ON [TAM_TX] = {'W','R','O','N'};
char CONF_COR [TAM_TX] = {'A','M','P','R'};
char TOMA_SI [TAM_TX] = {'L','D','O','N'};
char TOMA_NO [TAM_TX] = {'L','D','O','F'};
char TOMA_I_R [TAM_TX] = {'T','E','I','R'};
char CAMARA_OK [TAM_TX] = {'S','G','Y','E'};

int CENTENAS = 0;
int DECENAS = 0;
int UNIDADES = 0;
int PORCENTAJE = 101;
int PORCENTAJE_T = 0;

int DECIMAL  = 0;
int UNIDAD_1 = 0;
int UNIDAD_2 = 0;
float VALOR_COR = 100.0;
float VALOR_COR_T = 0.0;

char FG_COMIDA = 0;
char FG_AGUA = 0;
char TOMA_ON = 0;
char TOMA_OFF = 0;

char LETRA = ' ';

char E_CICLO = 1;
char E_COR = 1; 
char E_CAMARA = 1;
char E_COR_I = 1;

char PERMISO_CAMARA = 1;

char ERF_CICLO = 1;
char ERF_INTERRUP_OFF = 1;
char ERF_COMIDA = 1;
char ERF_AGUA = 1;
char ERF_TOMA_ON = 1;
char ERF_TOMA_OFF = 1;

char CRF_CAMARA = 1;
char CRF_DIMMER = 1;
char CRF_CORRIENTE = 1;

char ERF_CICLO_C = 0;
char ERF_INTERRUP_OFF_C = 0;
char ERF_COMIDA_C = 0;
char ERF_AGUA_C = 0;
char ERF_TOMA_ON_C = 0;
char ERF_TOMA_OFF_C = 0;

char TOMA_C = 0;

int main (void)
{
    //------------------------------------------------------------------------ CONFIGURACION DE RADIO ---------------------------------------------------------------
    ON = 1;
    RADIO.powerUp();
    CONF_INIC (MI_FREQ, POT, VELO, DIR_MAESTRO, TAM_DIRECCIONES, NRF24L01P_PIPE_P0);
    RADIO.setReceiveMode();
    RADIO.enable();
    PC.printf("Maestro encendido\r\n");
    PC.printf( "nRF24L01+ Frequency    : %d MHz\r\n",  RADIO.getRfFrequency() );
    PC.printf( "nRF24L01+ Output power : %d dBm\r\n",  RADIO.getRfOutputPower() );
    PC.printf( "nRF24L01+ Data Rate    : %d kbps\r\n", RADIO.getAirDataRate() );
    PC.printf( "nRF24L01+ TX Address   : 0x%010llX\r\n", RADIO.getTxAddress() );
    PC.printf( "nRF24L01+ RX Address   : 0x%010llX\r\n", RADIO.getRxAddress() );

    while (1)
    {
        //-------------------------------------------------------------- EVALUAR SI EXISTEN ALERTAS POR ATENDER DESDE RASPBERRY ------------------------------------------------------

        LEER_RASPBERRY ();
        
        //---------------------------------------------------------------------- ATENDER ALERTAS ENVIADAS POR RASPBERRY --------------------------------------------------------------

        if(FG_DIMMER == 1)              //OPTIMIZAR
        {
            PC.printf("FUNCION CAMBIAR DIMMER\r\n");
            ENVIAR_CICLO();                                 //LE SOLICITA A LA RASPBERRY EL VALOR DEL DIMMER, Y LO ENVIA AL ESCLAVO CORRESPONDIENTE
            FG_DIMMER = 0;    
        }
        if(FG_INTERRUPTOR_ON == 1)      //OPTIMIZAR
        {
            PC.printf("FUNCION ENCENDER INTERRUPTOR\r\n");
            ENVIAR_CICLO();                                 //LE SOLICITA A LA RASPBERRY EL VALOR DEL DIMMER, Y LO ENVIA AL ESCLAVO CORRESPONDIENTE
            FG_INTERRUPTOR_ON = 0;
        }
        if(FG_INTERRUPTOR_OFF == 1)
        {
            PC.printf("FUNCION APAGAR INTERRUPTOR\r\n");
            RASPBERRY.putc('I');                        //RESPONDER QUE SE RECIBIO LA ORDEN
            PC.printf("RESPONDIO CON UNA I \r\n");
            ERF_INTERRUP_OFF = 0;
            ENVIAR_ALERTAS();
            FG_INTERRUPTOR_OFF = 0;
        }
        if(FG_COMIDA == 1)
        {
            PC.printf("FUNCION DISPENSAR COMIDA\r\n");
            RASPBERRY.putc('G');                        //RESPONDER QUE SE RECIBIO LA ORDEN
            PC.printf("RESPONDIO CON UNA G \r\n");
            ERF_COMIDA = 0;
            ENVIAR_ALERTAS();
            FG_COMIDA = 0;
        }
        if(FG_AGUA == 1)
        {
            PC.printf("FUNCION DISPENSAR AGUA\r\n");
            RASPBERRY.putc('H');                        //RESPONDER QUE SE RECIBIO LA ORDEN
            PC.printf("RESPONDIO CON UNA H \r\n");
            ERF_AGUA = 0;
            ENVIAR_ALERTAS();
            FG_AGUA = 0;
        }
        if(TOMA_ON == 1)
        {
            PC.printf("FUNCION ENCENDER TOMA\r\n");
            RASPBERRY.putc('F');                        //RESPONDER QUE SE RECIBIO LA ORDEN
            PC.printf("RESPONDIO CON UNA F \r\n");
            ERF_TOMA_ON = 0;
            ENVIAR_ALERTAS();
            TOMA_ON = 0;
            TOMA_C = 1;
        }    
        if(TOMA_OFF == 1)
        {
            PC.printf("FUNCION APAGAR TOMA\r\n");
            RASPBERRY.putc('N');                        //RESPONDER QUE SE RECIBIO LA ORDEN
            PC.printf("RESPONDIO CON UNA N \r\n");
            ERF_TOMA_OFF = 0;
            ENVIAR_ALERTAS();
            TOMA_OFF = 0;
            TOMA_C = 0;
        } 

        //---------------------------------------------------------------------- REVISAR SI EL RADIO RECIBIÓ ALERTAS --------------------------------------------------------------

        if(RADIO.readable())
        {           
            PC.printf("ALGO LLEGO\r\n");
            RECIBIR();
            //------------------------------------------------------------ ALERTAS ESPERADAS DESDE CAMARA, DIMMER Y SENSOR DE CORRIENTE ------------------------------------------------
            if(RX_DATA[0] == 'S' && RX_DATA[1] == 'P' && RX_DATA[2] == 'A' && RX_DATA[3] == 'D')
            {
                if(PERMISO_CAMARA == 1)
                {
                    PC.printf("LA PUERTA SE ABRIO\r\n"); 
                    RASPBERRY.putc('P');  
                    CRF_CAMARA = 0;
                    ENVIAR_ALERTAS();
                    PERMISO_CAMARA = 0;
                    ESPERAR_T_CAMARA.attach(&HABILITAR_RECP_CAMARA,60);
                }
                else if(PERMISO_CAMARA == 0)
                {
                    PC.printf("LA PUERTA SE ABRIO\r\n");
                    CRF_CAMARA = 0;
                }
            }
                   
            if(RX_DATA [3] == 'C')
            {
                CRF_DIMMER = 0;
                ENVIAR_ALERTAS();

                CENTENAS = (RX_DATA [0] - 48) * 100;
                DECENAS = (RX_DATA [1] - 48) * 10;
                UNIDADES = (RX_DATA [2] - 48);
                PORCENTAJE_T = CENTENAS + DECENAS + UNIDADES;
               
               if(PORCENTAJE_T != PORCENTAJE && PORCENTAJE_T >= 0 && PORCENTAJE_T <= 100)
               {
                    PORCENTAJE = PORCENTAJE_T;
                    RASPBERRY.putc('C');
                    E_CICLO = 0;
                    /*while (E_CICLO == 0)    //REVISAR
                    {
                        LEER_RASPBERRY();
                    }*/
                    LEER_RASPBERRY();
               }
               else
               {
                   PC.printf("%d %d %d %d \r\n",CENTENAS,DECENAS,UNIDADES, PORCENTAJE);
               }
                
