IoT-EBOT/IoT-Home-Sistem-with-STM32-and-Raspberry/Controlador Maestro/Microcontrolador Maestro/Maestro Tranceptor Conectado a Raspberry.cpp
            }
            if(RX_DATA [3] == 'Z')
            {
                CRF_CORRIENTE = 0;
                ENVIAR_ALERTAS();

                DECIMAL  = (RX_DATA [0] - 48) * 100;
                UNIDAD_1 = (RX_DATA [1] - 48) *10;
                UNIDAD_2 = (RX_DATA [2] - 48);  
                
                VALOR_COR_T = DECIMAL + UNIDAD_1 + UNIDAD_2;
                                                               
                if(VALOR_COR_T != VALOR_COR && VALOR_COR_T >= 0.0 && VALOR_COR_T <= 500.0)
                {
                    VALOR_COR = VALOR_COR_T;
                    RASPBERRY.putc('Z');
                    E_COR = 0;                                                  
                    /*while (E_COR == 0)
                    {
                        LEER_RASPBERRY();
                    }*/
                    LEER_RASPBERRY();
                }
                else
                {
                    PC.printf("%f,%f\r\n",VALOR_COR_T,VALOR_COR); 
                }
            }
            if(RX_DATA[0] == 'T' && RX_DATA[1] == 'I' && RX_DATA[2] == 'O' && RX_DATA[3] == 'F')
            {
                if (TOMA_C == 0)
                {
                    RASPBERRY.putc('Q');
                    E_COR_I = 0;
                    TOMA_C = 1;
                }
                else
                {
                    E_COR_I = 0;
                }
            }
            //------------------------------------------------------------ CONFIRMACIONES DE RECEPCION DE ALERTAS ------------------------------------------------

            if(RX_DATA[0] == 'U' && RX_DATA[1] == 'U' && RX_DATA[2] == 'U' && RX_DATA[3] == 'U')
            {
                ERF_CICLO = 1;
                ERF_CICLO_C = 0;
            }

            if(RX_DATA[0] == 'O' && RX_DATA[1] == 'O' && RX_DATA[2] == 'U' && RX_DATA[3] == 'U')
            {
                ERF_INTERRUP_OFF = 1;
                ERF_INTERRUP_OFF_C = 0;
            }    

            if(RX_DATA[0] == 'D' && RX_DATA[1] == 'F' && RX_DATA[2] == 'O' && RX_DATA[3] == 'N')
            {
                ERF_COMIDA = 1;
                ERF_COMIDA_C = 0;
            }    

            if(RX_DATA[0] == 'D' && RX_DATA[1] == 'A' && RX_DATA[2] == 'O' && RX_DATA[3] == 'N')
            {
                ERF_AGUA = 1;
                ERF_AGUA_C = 0;
            }    

            if(RX_DATA[0] == 'T' && RX_DATA[1] == 'M' && RX_DATA[2] == 'O' && RX_DATA[3] == 'N')
            {
                ERF_TOMA_ON = 1;
                ERF_TOMA_ON_C = 0;
            }    

            if(RX_DATA[0] == 'T' && RX_DATA[1] == 'M' && RX_DATA[2] == 'O' && RX_DATA[3] == 'F')
            {
                ERF_TOMA_OFF = 1;
                ERF_TOMA_OFF_C = 0;
            }    

        }

        //--------------------------- ENVIAR ALERTAS SI HAY CONFIRMACIONES PENDIENTES O SE RECIBIÓ NUEVAMENTE ALERTAS DESDE CAMARA, SENSOR O DIMMER ---------------------------

        ENVIAR_ALERTAS ();     
    }
}

void CONF_INIC (int FRECUENCIA, int POTENCIA, int VELOCIDAD, unsigned long long DIRECCION, int ANCHO, int TUBERIA)
{
    RADIO.setRfFrequency(FRECUENCIA);
    RADIO.setRfOutputPower(POTENCIA);
    RADIO.setAirDataRate(VELOCIDAD);
    RADIO.setRxAddress(DIRECCION, ANCHO, TUBERIA);
}
void PREPARAR (int ANCHO, unsigned long long DIRECCION, int TAM_DIR, int RF)
{
    RADIO.setTransferSize (ANCHO);
    RADIO.setTxAddress (DIRECCION,TAM_DIR);
    RADIO.setRfFrequency (RF);
}
void RECIBIR (void)
{
    int rxDataCnt = 0;
    RADIO.read(NRF24L01P_PIPE_P0, RX_DATA, TAM_TX);
    for(int i = 0; i<=TAM_TX; i++)
    {
        PC.printf("%c",RX_DATA[i]);
    }
    PC.printf("\r\n");
}
void ENVIAR_CICLO (void)
{
    char ESPERANDO = 1;     
    char POS = 0;           
    
    RASPBERRY.putc('U');                        //RESPONDER QUE SE ESTA LISTO PARA RECIBIR EL ARREGLO
    PC.printf("RESPONDIO CON UNA U \r\n");
    while(ESPERANDO == 1)
    {
        if(RASPBERRY.readable() == 1)
        {
            DATA_CICLO [POS] = RASPBERRY.getc();
            POS = POS + 1;
        }
        if(POS > 3)
        {
            POS = ESPERANDO = 0;
        }        
    }
    RASPBERRY.putc('R');
    PC.printf("RESPONDIO CON UNA R \r\n");  

    ERF_CICLO = 0;
    ENVIAR_ALERTAS();
}

void LEER_RASPBERRY (void)
{
    char CONFIRMAR_1 = 1;
    char CONFIRMAR_2 = 1;

    if(RASPBERRY.readable() == 1)               //EVALUA SI HAY ALGUNA ACCION POR REALIZAR SEGUN LO QUE LA RASPBERRY ENVIA
    {
        PC.printf("Hay algo para leer\r\n");
        OPCION = RASPBERRY.getc();
        switch (OPCION)                         //DEFINE CUÁL ACCION SE REQUIERE REALIZAR
        {
            case 'A':
            {
                FG_DIMMER = 1;
                PC.printf("A: CAMBIO DIMMER\r\n");
                break;
            }
            case 'B':
            {
                FG_INTERRUPTOR_ON = 1;
                PC.printf("B: DIMMER EN ON\r\n");
                break;
            }
            case 'I':
            {
                FG_INTERRUPTOR_OFF = 1;
                PC.printf("I: DIMMER EN OFF\r\n");
                break;
            }
            case 'D':
            {
                FG_COMIDA = 1;
                PC.printf("D\r\n");
                break;
            }
            case 'E':
            {
                FG_AGUA = 1;
                PC.printf("E\r\n");
                break;
            }
            case 'F':
            {
                TOMA_ON = 1;
                PC.printf("F:\r\n");
                break;
            }
            case 'G':
            {
                TOMA_OFF = 1;
                PC.printf("G:\r\n");
                break;
            }
            //------------------------------------------------------------------RESPUESTAS A ALERTAS GENERADAS DESDE EL MICRO------------------------------------------------
            case 'C':
            {
                RASPBERRY.printf("%d",PORCENTAJE);
                PC.printf("%d",PORCENTAJE);
                CONFIRMAR_1 = 0;
                while (CONFIRMAR_1 == 0)
                {
                    if(RASPBERRY.readable() == 1)
                    {
                        LETRA = RASPBERRY.getc();
                        if(LETRA == 'c')
                        {
                            CONFIRMAR_1 = 1;
                            E_CICLO = 1;
                        }
                    }
                }
                break;
            }

            case 'Z':
            {
                RASPBERRY.printf("%f",VALOR_COR);
                CONFIRMAR_2 = 0;
                while (CONFIRMAR_2 == 0)
                {
                    if(RASPBERRY.readable() == 1)
                    {
                        LETRA = RASPBERRY.getc();
                        if(LETRA == 'z')
                        {
                            CONFIRMAR_2 = 1;
                            E_COR = 1;
                        }
                    }
                }
                break;
            }

            case 'T':
            {
                E_CAMARA = 1;
                break;
            }
            case 'Q':
            {
                E_COR_I = 1;
                break;
            }
        }    
    }
}

void ENVIAR_ALERTAS (void)
{
    //--------------------------------------------------------------------ENVIAR CICLO ÚTIL AL DIMMER------------------------------------------------------------
    if (ERF_CICLO == 0 && ERF_CICLO_C <= 20)
    {
        RADIO.setTransmitMode();
        PREPARAR(TAM_TX, DIR_DIMMER, TAM_DIRECCIONES, RF_DIMMER);
        RADIO.write(NRF24L01P_PIPE_P0, DATA_CICLO, TAM_TX);
        PC.printf("+++RADIO ENVIO INFORMACION+++ \r\n");
        RADIO.setRfFrequency (MI_FREQ);
        RADIO.setReceiveMode();
        wait_ms (RETARDO);
        if(RADIO.readable())
        {
            PC.printf("RADIO TIENE ALGO PARA LEER \r\n");
            RECIBIR();
            if(RX_DATA[0] == 'U' && RX_DATA[1] == 'U' && RX_DATA[2] == 'U' && RX_DATA[3] == 'U')
            {
                ERF_CICLO = 1;
                RADIO.setRfFrequency (MI_FREQ);
                RADIO.setReceiveMode();
                ERF_CICLO_C = 0;
            }
        }
        ERF_CICLO_C = ERF_CICLO_C + 1;
        PC.printf("CONTADOR = %i \r\n",ERF_CICLO_C);
    }
    else if(ERF_CICLO == 0 && ERF_CICLO_C > 20)
    {
        ERF_CICLO_C = 0;
        ERF_CICLO = 1;
    }
    if(ERF_INTERRUP_OFF == 0 && ERF_INTERRUP_OFF_C <= 20)
    {
        RADIO.setTransmitMode();
        PREPARAR(TAM_TX, DIR_DIMMER, TAM_DIRECCIONES, RF_DIMMER);
        RADIO.write(NRF24L01P_PIPE_P0, INTE_OFF, TAM_TX);
        PC.printf("RADIO ENVIO MENSAJE \r\n");
        RADIO.setRfFrequency (MI_FREQ);
        RADIO.setReceiveMode();
        wait_ms (RETARDO);
        if(RADIO.readable())
        {
            PC.printf("RADIO TIENE ALGO PARA LEER \r\n");
            RECIBIR();
            if(RX_DATA[0] == 'O' && RX_DATA[1] == 'O' && RX_DATA[2] == 'U' && RX_DATA[3] == 'U')
            {
                ERF_INTERRUP_OFF = 1;
                RADIO.setRfFrequency (MI_FREQ);
                RADIO.setReceiveMode();
                ERF_INTERRUP_OFF_C = 0;
            }    
        }
        ERF_INTERRUP_OFF_C = ERF_INTERRUP_OFF_C + 1;
        PC.printf("CONTADOR = %i \r\n",ERF_INTERRUP_OFF_C);
    }
    else if(ERF_INTERRUP_OFF == 0 && ERF_INTERRUP_OFF_C > 20)
    {
        ERF_INTERRUP_OFF_C = 0;
        ERF_INTERRUP_OFF = 1;
    }
    if(ERF_COMIDA == 0 && ERF_COMIDA_C <= 20)
    {
        RADIO.setTransmitMode();
        PREPARAR(TAM_TX, DIR_DISPENSADOR, TAM_DIRECCIONES, RF_DISPENSADOR);
        RADIO.write(NRF24L01P_PIPE_P0, FOOD_ON, TAM_TX);
        PC.printf("RADIO ENVIO MENSAJE \r\n");
        RADIO.setRfFrequency (MI_FREQ);
        RADIO.setReceiveMode();
        wait_ms (RETARDO);
        if(RADIO.readable())
        {
            PC.printf("RADIO TIENE ALGO PARA LEER \r\n");
            RECIBIR();
            if(RX_DATA[0] == 'D' && RX_DATA[1] == 'F' && RX_DATA[2] == 'O' && RX_DATA[3] == 'N')
            {
                ERF_COMIDA = 1;
                RADIO.setRfFrequency (MI_FREQ);
                RADIO.setReceiveMode();
                ERF_COMIDA_C = 0;
            }    
        }
        ERF_COMIDA_C = ERF_COMIDA_C + 1;    
        PC.printf("CONTADOR = %i \r\n",ERF_COMIDA_C);
    }
    else if(ERF_COMIDA == 0 && ERF_COMIDA_C > 20)
    {
        ERF_COMIDA_C = 0;
        ERF_COMIDA = 1;
    }
    if(ERF_AGUA == 0 && ERF_AGUA_C <= 20)
    {
        RADIO.setTransmitMode();
        PREPARAR(TAM_TX, DIR_DISPENSADOR, TAM_DIRECCIONES, RF_DISPENSADOR);
        RADIO.write(NRF24L01P_PIPE_P0, WATE_ON, TAM_TX);
        PC.printf("RADIO ENVIO MENSAJE \r\n");
        RADIO.setRfFrequency (MI_FREQ);
        RADIO.setReceiveMode();
        wait_ms (RETARDO);
        if(RADIO.readable())
        {
            PC.printf("RADIO TIENE ALGO PARA LEER \r\n");
            RECIBIR();
            if(RX_DATA[0] == 'D' && RX_DATA[1] == 'A' && RX_DATA[2] == 'O' && RX_DATA[3] == 'N')
            {
                ERF_AGUA = 1;
                RADIO.setRfFrequency (MI_FREQ);
                RADIO.setReceiveMode();
                ERF_AGUA_C = 0;
            }    
        } 
        ERF_AGUA_C = ERF_AGUA_C + 1;   
        PC.printf("CONTADOR = %i \r\n",ERF_COMIDA_C);
    }
    else if(ERF_AGUA == 0 && ERF_AGUA_C > 20)
    {
        ERF_AGUA_C = 0;
        ERF_AGUA = 1;
    }
    if (ERF_TOMA_ON == 0 && ERF_TOMA_ON_C <= 20)
    {
        RADIO.setTransmitMode();
        PREPARAR(TAM_TX, DIR_TOMA, TAM_DIRECCIONES, RF_TOMA);
        RADIO.write(NRF24L01P_PIPE_P0, TOMA_SI, TAM_TX);
        PC.printf("RADIO ENVIO MENSAJE \r\n");
        RADIO.setRfFrequency (MI_FREQ);
        RADIO.setReceiveMode();
        wait_ms (RETARDO);
        if(RADIO.readable())
        {
            PC.printf("RADIO TIENE ALGO PARA LEER \r\n");
            RECIBIR();
            if(RX_DATA[0] == 'T' && RX_DATA[1] == 'M' && RX_DATA[2] == 'O' && RX_DATA[3] == 'N')
            {
                ERF_TOMA_ON = 1;
                RADIO.setRfFrequency (MI_FREQ);
                RADIO.setReceiveMode();
                ERF_TOMA_ON_C = 0;
            }    
        } 
        ERF_TOMA_ON_C = ERF_TOMA_ON_C + 1;
        PC.printf("CONTADOR = %i \r\n",ERF_TOMA_ON_C);
    }
    else if (ERF_TOMA_ON == 0 && ERF_TOMA_ON_C > 20)
    {
        ERF_TOMA_ON_C = 0;
        ERF_TOMA_ON = 1;
    }
    if(ERF_TOMA_OFF == 0 && ERF_TOMA_OFF_C <= 20)
    {
        RADIO.setTransmitMode();
        PREPARAR(TAM_TX, DIR_TOMA, TAM_DIRECCIONES, RF_TOMA);
        RADIO.write(NRF24L01P_PIPE_P0, TOMA_NO, TAM_TX);
        PC.printf("RADIO ENVIO MENSAJE \r\n");
        RADIO.setRfFrequency (MI_FREQ);
        RADIO.setReceiveMode();
        wait_ms (RETARDO);
        if(RADIO.readable())
        {
            PC.printf("RADIO TIENE ALGO PARA LEER \r\n");
            RECIBIR();
            if(RX_DATA[0] == 'T' && RX_DATA[1] == 'M' && RX_DATA[2] == 'O' && RX_DATA[3] == 'F')
            {
                ERF_TOMA_OFF = 1;
                RADIO.setRfFrequency (MI_FREQ);
                RADIO.setReceiveMode();
                ERF_TOMA_OFF_C = 0;
            }    
        }
        ERF_TOMA_OFF_C = ERF_TOMA_OFF_C + 1;
        PC.printf("CONTADOR = %i \r\n",ERF_TOMA_OFF_C);
    }
    else if(ERF_TOMA_OFF == 0 && ERF_TOMA_OFF_C > 20)
    {
        ERF_TOMA_OFF_C = 0;
        ERF_TOMA_OFF = 1;
    }
    if(CRF_CAMARA == 0) //AQUI HAY QUE CONDICIONAR EL TEMA DE QUE SI LA ALAERTA SE RECIBIÓ HACE MENOS DE 1 MINUTO IGNORE LAS ALERTAS QUE LLEGUEN
    {
        RADIO.setTransmitMode();
        PREPARAR(TAM_TX, DIR_PUERTA, TAM_DIRECCIONES, RF_PUERTA);
        RADIO.write(NRF24L01P_PIPE_P0, CAMARA_OK, TAM_TX);
        PC.printf("SE LE RESPONDIO QUE LA ALERTA SE RECIBIO \r\n"); 
        RADIO.setRfFrequency(MI_FREQ);
        RADIO.setReceiveMode();
        wait_ms(250);                                                      
        E_CAMARA = 0;
        /*while (E_CAMARA == 0)
        {
            LEER_RASPBERRY();
        }*/
        CRF_CAMARA = 1;
    }
    if(CRF_DIMMER == 0)
    {
        RADIO.setTransmitMode();
        PREPARAR(TAM_TX, DIR_DIMMER, TAM_DIRECCIONES, RF_DIMMER);
        RADIO.write(NRF24L01P_PIPE_P0, CONF_CIC, TAM_TX);
        PC.printf("SE RESPONDIO \r\n");
        RADIO.setRfFrequency(MI_FREQ);
        RADIO.setReceiveMode();
        wait_ms(250);
        for(int i = 0; i<TAM_TX; i++)
        {
            PC.printf("%c",CONF_CIC[i]);
        }
        PC.printf("\r\n");
        CRF_DIMMER = 1;
    }
    if(CRF_CORRIENTE == 0)
    {
        RADIO.setTransmitMode();
        PREPARAR(TAM_TX, DIR_TOMA, TAM_DIRECCIONES, RF_TOMA);
        RADIO.write(NRF24L01P_PIPE_P0, CONF_COR, TAM_TX);
        PC.printf("SE RESPONDIO \r\n");
        RADIO.setRfFrequency(MI_FREQ);
        RADIO.setReceiveMode();
        wait_ms(250);
        for(int i = 0; i<TAM_TX; i++)
        {
            PC.printf("%c",CONF_COR[i]);
        }
        PC.printf("\r\n");
        CRF_CORRIENTE = 1;
    }
    if (E_COR_I == 0)
    {
        RADIO.setTransmitMode();
        PREPARAR(TAM_TX, DIR_TOMA, TAM_DIRECCIONES, RF_TOMA);
        RADIO.write(NRF24L01P_PIPE_P0, TOMA_I_R, TAM_TX);
        PC.printf("SE RESPONDIO \r\n");
        RADIO.setRfFrequency(MI_FREQ);
        RADIO.setReceiveMode();
        wait_ms(250);
        for(int i = 0; i<TAM_TX; i++)
        {
            PC.printf("%c",CONF_COR[i]);
        }
        PC.printf("\r\n");
        E_COR_I = 1;
    }
}

void HABILITAR_RECP_CAMARA (void)
{
    PERMISO_CAMARA = 1;
}